// Задача 41: Пользователь вводит с клавиатуры M чисел. Посчитайте, сколько чисел больше 0 ввёл пользователь.
// 0, 7, 8, -2, -2 -> 2
// 1, -7, 567, 89, 223-> 3

Console.Write("Введите числа через пробел: ");
int[] numbers = Array.ConvertAll(Console.ReadLine().Split(), int.Parse);
int result = CheckArray(numbers);
Console.WriteLine($"Количество введенных чисел больше 0 = {result}");

int CheckArray(int[] array)
{
    int count = 0;
    for (int i = 0; i < array.Length; i++)
    {
        if (array[i] > 0) count++;
    }
    return count;
}
